app/views/students/index.html.erb

SELECT COUNT(*) FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 1 AND (mold = 'Teacher')
SELECT `users`.* FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 1 AND (mold = 'teacher' )
---
                    <% end %>
                    <% if !student.class_rooms.first.users.where("mold = 'Teacher'").empty? %>