app/views/students/show.html.erb

      <dt>授课老师</dt>
      <% @student.class_rooms.first.users.where("type = 'Student' ").each do |f| %>
---
SELECT `users`.* FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 1 AND (mold = 'Teacher' )