app/views/class_rooms/index.html.erb

SELECT  1 AS one FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 2 AND `users`.`mold` = 'Student' LIMIT 1
SELECT COUNT(*) FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 4 AND (mold = 'Student')
---
                    <th><%= room.roomname %></th>
                    <% if room.users.exists?(mold: 'Student') %>
                        <th><%= room.users.where("mold = 'Student'").size %></th>