app/views/users/edit.html.erb

SELECT `class_rooms`.* FROM `class_rooms`
---
    <%= form_tag(user_path(@user), method: :patch) do %>
    <%= select("classroom", "id", ClassRoom.all.collect {|c| [c.roomname, c.id]}, { include_blank: true}, class: "form-control") %>