app/views/users/show.html.erb

SELECT `class_rooms`.* FROM `class_rooms`
---
                        <th><%= student.name %></th>
                        <%if !student.class_rooms.empty?%>

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('Student')
---
                       <th><%= room.roomname %></th>
                       <% if room.users.exists?(mold: 'Student') %>