app/views/teachers/index.html.erb

SELECT COUNT(*) FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 1 AND (mold = 'Student')
SELECT `users`.* FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 1 AND (mold = 'Student' )
---
                        <% end %>
                        <% if !teacher.class_rooms.first.users.where("mold = 'Student'").empty? %>