app/controllers/class_rooms_controller.rb

  def index
    @class_rooms = ClassRoom.page(params[:id] || 1).per_page(params[:per_page] || 10).order("id desc")
---
SELECT  `class_rooms`.* FROM `class_rooms` ORDER BY id desc LIMIT 10 OFFSET 0

  def search
    @class_rooms = ClassRoom.page(params[:page] || 1).per_page(params[:per_page] || 10)
      .order("id desc").where(["roomname like ?", "%#{params[:roomname]}%"])
---
SELECT  `class_rooms`.* FROM `class_rooms` WHERE (roomname like '%云计算三班%') ORDER BY id desc LIMIT 10 OFFSET 0

  def get_teachers
    class_room = ClassRoom.find params[:id]
    @teachers = class_room.users.where("mold = 'Teacher' ").all
---
SELECT  `class_rooms`.* FROM `class_rooms` WHERE `class_rooms`.`id` = 5 LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 5 AND (mold = 'Teacher' )