app/controllers/teachers_controller.rb

SELECT `users`.* FROM `users` INNER JOIN `user_and_class_rooms` ON `users`.`id` = `user_and_class_rooms`.`user_id` WHERE `user_and_class_rooms`.`class_room_id` = 1 AND (mold = 'Student' )
---
        def get_students
            teacher = Teacher.find params[:id]
            @students = teacher.class_rooms.first.users.where("mold = 'Student' ").all