app/controllers/users_controller.rb

    def create
        @user = User.new
        if params[:user][:mold] == "Student"
            @student = Student.new(user_attrs)
            if @student.save
---
INSERT INTO `users` (`name`, `type`, `crypted_password`, `salt`, `created_at`, `updated_at`, `mold`, `admin`) VALUES ('张四', 'Student', 'f84b634d7035d6bdffc3510bac8482a4baaada5f0e4daa449a57fd55d65c291f', '1491445884', '2017-04-06 02:31:24', '2017-04-06 02:31:24', 'Student', 0)

    def show
            @class_rooms = ClassRoom.all
---
SELECT `class_rooms`.* FROM `class_rooms`

    def edit
            @user = User.find(params[:id])
            @class_rooms = ClassRoom.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `class_rooms`.* FROM `class_rooms`

    def update
            class_room = nil
            class_room = ClassRoom.find(params[:classroom][:id]) unless params[:classroom][:id].blank?
            user = User.find(params[:id])
---
SELECT  `class_rooms`.* FROM `class_rooms` WHERE `class_rooms`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def destroy
            User.find(params[:id]).destroy unless params[:id].eql? current_user.id.to_s
---
DELETE FROM `users` WHERE `users`.`type` IN ('Student') AND `users`.`id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1

    def create_room
            class_room = nil
            class_room = ClassRoom.find_by(roomname:params[:roomname])
            if class_room.nil?
                    class_room = ClassRoom.create(roomname: params[:roomname])
---
SELECT  `class_rooms`.* FROM `class_rooms` WHERE `class_rooms`.`roomname` = '移动三班' LIMIT 1
INSERT INTO `class_rooms` (`roomname`, `created_at`, `updated_at`) VALUES ('移动三班', '2017-04-10 03:10:18', '2017-04-10 03:10:18')